/*******************************************************************************
* タイトル:		mapプログラム
* プログラム名:	map.cpp
* 作成者:		GP11B132 05 王ウ華
* 作成日:		2022/07/07
*******************************************************************************/


/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "main.h"
#include "player.h"
#include "enemy.h"
#include "field.h"
#include "map.h"

/*******************************************************************************
* マクロ定義
*******************************************************************************/


/*******************************************************************************
* 構造体定義
*******************************************************************************/


/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/


/*******************************************************************************
* グローバル変数
*******************************************************************************/

// main map data
char map1[MAINMAP_H][MAINMAP_W] = {
	"|============================================================================|",
	"|                                                                            |",
	"|                                                  XXXXXX                    |",
	"|              XXXXXXXXXXXXXXXX                                              |",
	"|                          XXXXX            XXX                              |",
	"|                                                        ////                |",
	"|                                          ////////////////                  |",
	"|          XXXXX                       XXXXXXXX         ////       XXXXXXXXX |",
	"|XXX                            XXXXXXX            /////////                 |",
	"|             XXXXX                                                          |",
	"|                  XXXXXX                           //////          XXX      |",
	"|X                        XXXX                      ////       //            |",
	"|                                                            /////////      X|",
	"|              XX             XXXXX         XXXX                           XX|",
	"|XXX                                                XXXXXXX                 X|",
	"|XXXXXX                     XXX                                              |",
	"|XXXX       XXXX                         XXXX                                |",
	"|                           XXXX                                             |",
	"|                                                  XXXXXXX             XXXXXX|",
	"|                      ////                     XXXXXXXX              XXXXXX |",
	"|                    /////////        XX                  XXXX     XXXXXXXXXX|",
	"|     XXXXXXX      /////                                        XXXXXXXXXXX  |",
	"|                                                                            |",
	"|============================================================================|",
};

char map2[MAINMAP_H][MAINMAP_W] = {
	"|============================================================================|",
	"|                                                                            |",
	"|                          /////                    XXXX                     |",
	"|                  //////////                                                |",
	"|                    /////                 XXXX                  XXX         |",
	"|                      /////                                                 |",
	"|                  //////////                                                |",
	"|XXXX                 ////////                                        XXXXXXX|",
	"|XXX                     ////////   XXXX                    XX          XXXX |",
	"|                                  XXXXXX              XXXX                  |",
	"|                    XXXXXX                 XXX                              |",
	"|        //////              XXXX                 XX      XXXX            XXX|",
	"|      //////                                                                |",
	"|         ////    XX             XXXXX                 XXX          XXX      |",
	"|                                    XXXXXX              X                   |",
	"|XXX                                                                         |",
	"|XXXXXX               XXX                 ////////                           |",
	"|                                                                            |",
	"|                                                 XXXXXXX                    |",
	"|                             XXXXXXXXXXXXXX                                 |",
	"|     XXXXXXX              XXXX                     XXXX           //////////|",
	"|XXX      XX                          XXXXXX                     ////////////|",
	"|                                                                            |",
	"|============================================================================|",
};

char map3[MAINMAP_H][MAINMAP_W] = {
	"|============================================================================|",
	"|                                                                            |",
	"|                        XXXX             XXXX                               |",
	"|                                                          ///////////       |",
	"|              XXXX                                            //////////    |",
	"|     XXX                                                        /////////// |",
	"|                                                     ///////////////////////|",
	"|                                   XXXX                           XXX////// |",
	"|      XX      XXX                                    X                //////|",
	"|                         XX                                     ////////////|",
	"|                                                             //////////  ///|",
	"|            X                                   XX   ///////////////////////|",
	"|                XX            //////     XX        /////////////XXXXXXX/////|",
	"|                                 /////               ////////////XXXXX//////|",
	"|X                     XXX     //////                    ////////////////////|",
	"|                                 ////   XXXX      //////////////////////////|",
	"|                               ////////          ////////////////////////// |",
	"|XXX                             ////////////////////////////////////////////|",
	"|X                            XX   //////     ////         ///////////////// |",
	"|                      XXXX         ////             ///////      /////XXXXXX|",
	"|       XXX                     ////////    XXXX    ///////////          ////|",
	"|                         XXXX  XX              X     ///////////            |",
	"|                                                                            |",
	"|============================================================================|",
};

char map4[MAINMAP_H][MAINMAP_W] = {
	"|============================================================================|",
	"|                                                                            |",
	"|                                                          XXXXXXXXXX        |",
	"|                                    XXX                      XXXXXXXXXXXX   |",
	"|      ////        XXXX                                 ///////////////      |",
	"|        ////////                                        /////////           |",
	"|           ////                                             //////          |",
	"|     XXXX                     XXXXXX                XXXX      ////          |",
	"|      XX      XXX                                               /////      X|",
	"|                                                             ////////       |",
	"|            X                                   XX            //// XXXXXX   |",
	"|  XX                 XXX        XXXX                ////       ////         |",
	"|XX                                       XXX          ////  ////////        |",
	"|XX                                XXX                  ///////            X |",
	"|                      XXX                  XX X      ////////////           |",
	"|                  XXXXXXXXXXXX                          ////                |",
	"|XXX                                                   /////        XXXXXX   |",
	"|X                            ////////////           ////////////            |",
	"|        XX                    //////// XXXX      ////         ////       XX |",
	"|                      XXXX  //////////////////////////           ////       |",
	"|                ////     //////////                       XXXXXX    ////    |",
	"|     XX             ///////////////////     X                               |",
	"|                                                                            |",
	"|============================================================================|",
};


char map_orig[MAINMAP_H][MAINMAP_W] = {
	"|============================================================================|",
	"|                                                                            |",
	"|                                                                            |",
	"|                                                                            |",
	"|                                                                            |",
	"|                                                                            |",
	"|                                                                            |",
	"|                                                                            |",
	"|                                                                            |",
	"|                                                                            |",
	"|                                                                            |",
	"|                                                                            |",
	"|                                                                            |",
	"|                                                                            |",
	"|                                                                            |",
	"|                                                                            |",
	"|                                                                            |",
	"|                                                                            |",
	"|                                                                            |",
	"|                                                                            |",
	"|                                                                            |",
	"|                                                                            |",
	"|                                                                            |",
	"|============================================================================|",
};

// call map*5
MAP map[5];


// 初期化
void InitMap(void) {
	//memcpy(map_orig, map1, sizeof(map_orig));
	//for (int y = 0; y < MAINMAP_H; y++) {
	//	for (int x = 0; x < MAINMAP_W; x++) {
	//		map[1].map[y][x] = map1[y][x];
	//		map[2].map[y][x] = map2[y][x];
	//		map[3].map[y][x] = map3[y][x];
	//		map[4].map[y][x] = map4[y][x];
	//	}
	//}

	switch (GetMode()) {
	case GAME_MODE:
		memcpy(map_orig, map1, sizeof(map_orig));
		break;

	case GAME_MAP2:
		memcpy(map_orig, map2, sizeof(map_orig));
		break;

	case GAME_MAP3:
		memcpy(map_orig, map3, sizeof(map_orig));
		break;

	case GAME_MAP4:
		memcpy(map_orig, map4, sizeof(map_orig));
		break;
	}
}

// 終了処理
void UninitMap(void) {

}

// 更新処理
void UpdateMap(void) {
	switch (GetMode()) {
	case GAME_MODE:
		memcpy(map_orig, map1, sizeof(map_orig));
		break;

	case GAME_MAP2:
		memcpy(map_orig, map2, sizeof(map_orig));
		break;

	case GAME_MAP3:
		memcpy(map_orig, map3, sizeof(map_orig));
		break;

	case GAME_MAP4:
		memcpy(map_orig, map4, sizeof(map_orig));
		break;
	}
}

// 描画処理
void DrawMap(void) {

	for (int i = 0; i < MAINMAP_H; i++) {
		printf("%s\n", &map_orig[i][0]);
	}
}

void SetMap(int y, int x, char data) {
	map_orig[y][x] = data;
}

int CheckMap(int y, int x) {
	int mns = 0;

	char data = map_orig[y][x];
	switch (data){
	case '=':
	case '|':
	case '-':
	case 'X':
	case '/'
		:
		mns = 1;	
		break;

	default:
		break;
	}

	return mns;		
}

char* getmap()
{
	return nullptr;
}
